packages/helpers/woc-api/test/token_perf_test/token_1000rps_AddressTokens.yml
scenarios:
  ########## Only address/token endpoint ##########
  get-requests: #check setting here https://gettaurus.org/docs/locust/#Data-sources
    timeout: 5s
    # data-sources:  // when we switch to testnet we will need the following
    #   - path: token_20rps.yml
    #     delimiter: ";"
    #     quoted: false
    #     loop: true
    #     variable-names: apiKey
    #     random-order: false
    headers:
      Accept: "Content-Type: application/json"
      Authorization: 
          name: taal_private
          password: dotheT@@l007
    requests: 
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/address/mq7psuJ7Z9h1w4H3YtcCoHx7cPmhVM9UsV/tokens
        label: "GET https://taalnet.whatsonchain.com/v1/bsv/taalnet/address/<address>/tokens"  

execution:
  - scenario: get-requests
    concurrency: 50
    hold-for: 2m
    ramp-up: 10s
    iterations: 10000
    throughput: 1000000

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  local:
    capacity: 20
  locust:
    cmdline: --loglevel DEBUG