packages/helpers/woc-api/test/token_perf_test/token_1000rps_All!AddressTokens.yml
scenarios:
  ########## All Endpoints Apart from address/tokens  ##########
  get-requests: #check setting here https://gettaurus.org/docs/locust/#Data-sources
    timeout: 5s
    # data-sources:  // when we switch to testnet we will need the following
    #   - path: token_20rps.yml
    #     delimiter: ";"
    #     quoted: false
    #     loop: true
    #     variable-names: apiKey
    #     random-order: false
    headers:
      Accept: "Content-Type: application/json"
      Authorization: 
          name: taal_private
          password: dotheT@@l007
    requests: 
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/tokens
        label: "GET /v1/bsv/taalnet/tokens"
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/token/af7e4e60db56bed03c9fbbc4e11d66e1c91dc6dd/TAALT/tx
        label: "GET /v1/bsv/taalnet/token/<tokenId>/<symbol>/tx"
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/token/af7e4e60db56bed03c9fbbc4e11d66e1c91dc6dd/TAALT
        label: "GET /v1/bsv/taalnet/token/<tokenId>/<symbol>"
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/address/mq7psuJ7Z9h1w4H3YtcCoHx7cPmhVM9UsV/tokens/unspent
        label: "GET /v1/bsv/taalnet/address/<address>/tokens/unspent"
      - url: https://taalnet.whatsonchain.com/v1/bsv/taalnet/token/tx/2fd0737fe7bf1644da55b414b267eaff43ed06c774db866aec6cfe88869d269c/out/1
        label: "GET v1/bsv/taalnet/token/tx/<txId>/out/<vout>"  

execution:
  - scenario: get-requests
    concurrency: 50
    hold-for: 2m
    ramp-up: 10s
    iterations: 10000
    throughput: 1000000

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  local:
    capacity: 20
  locust:
    cmdline: --loglevel DEBUG